.. _ytunnus_userguide:

y-tunnus Strings
============

Introduction
------------

The function :func:`clean_fi_ytunnus() <dataprep.clean.clean_fi_ytunnus.clean_fi_ytunnus>` cleans a column containing Finnish business identifier (y-tunnus) strings, and standardizes them in a given format. The function :func:`validate_fi_ytunnus() <dataprep.clean.clean_fi_ytunnus.validate_fi_ytunnus>` validates either a single y-tunnus strings, a column of y-tunnus strings or a DataFrame of y-tunnus strings, returning `True` if the value is valid, and `False` otherwise.

y-tunnus strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "20774740"
* `standard`: y-tunnus strings with proper whitespace in the proper places, like "2077474-0"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_fi_ytunnus()` and `validate_fi_ytunnus()`.

### An example dataset containing y-tunnus strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "ytunnus": [
            "20774740",
            "2077474-1",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

          ytunnus                                           address
0        20774740                                     123 Pine Ave.
1       2077474-1                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_fi_ytunnus`

By default, `clean_fi_ytunnus` will clean ytunnus strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_fi_ytunnus
clean_fi_ytunnus(df, column = "ytunnus")

,ytunnus,address,ytunnus_clean
0,20774740,123 Pine Ave.,2077474-0
1,2077474-1,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_fi_ytunnus(df, column = "ytunnus", output_format="standard")

,ytunnus,address,ytunnus_clean
0,20774740,123 Pine Ave.,2077474-0
1,2077474-1,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_fi_ytunnus(df, column = "ytunnus", output_format="compact")

,ytunnus,address,ytunnus_clean
0,20774740,123 Pine Ave.,20774740
1,2077474-1,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned y-tunnus strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_fi_ytunnus(df, column="ytunnus", inplace=True)

  ytunnus_clean                                           address
0     2077474-0                                     123 Pine Ave.
1           NaN                                           main st
2           NaN                      1234 west main heights 57033
3           NaN                    apt 1 789 s maple rd manhattan
4           NaN                robie house, 789 north main street
5           NaN  (staples center) 1111 S Figueroa St, Los Angeles
6           NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_fi_ytunnus(df, "ytunnus", errors="coerce")

,ytunnus,address,ytunnus_clean
0,20774740,123 Pine Ave.,2077474-0
1,2077474-1,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_fi_ytunnus(df, "ytunnus", errors="ignore")

,ytunnus,address,ytunnus_clean
0,20774740,123 Pine Ave.,2077474-0
1,2077474-1,main st,2077474-1
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_fi_ytunnus()`

`validate_fi_ytunnus()` returns `True` when the input is a valid y-tunnus. Otherwise it returns `False`.

The input of `validate_fi_ytunnus()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_fi_ytunnus()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_fi_ytunnus()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_fi_ytunnus
print(validate_fi_ytunnus("20774740"))
print(validate_fi_ytunnus("2077474-1"))
print(validate_fi_ytunnus("51824753556"))
print(validate_fi_ytunnus("51 824 753 556"))
print(validate_fi_ytunnus("hello"))
print(validate_fi_ytunnus(np.nan))
print(validate_fi_ytunnus("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_fi_ytunnus(df["ytunnus"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: ytunnus, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_fi_ytunnus(df, column="ytunnus")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: ytunnus, dtype: bool

### Only DataFrame

In [11]:
validate_fi_ytunnus(df)

   ytunnus  address
0     True    False
1    False    False
2    False    False
3    False    False
4    False    False
5    False    False
6    False    False